package day07;

public class set_01 {
    public static void main(String[] args) {
        // 生活中也有集合的概率
        // java中的集合是一个名词，数据的一种容器
        // 用于容纳数据
        // java提供了完整的集合框架

        // 什么时候需要一个容纳数据的容器
        // 如果只是为了容纳数据，可以直接使用数组，为什么需要学习集合
        // 数组使用非常不方便
        // 数组只能容纳一种固定的类型
        // 数组有容量限制
        // 在数据的个数不确定的时候，使用数组不是很方便

        // Java集合框架包含了对不确定个数的数据处理的集合类

        // 对不确定的有关系的数据进行相同的逻辑处理的场合，使用集合处理是一个不错的选择

        // 根据数据的不同，java中的集合主要分为两大体系

        // 1.单一数据体系：单一的数据作为容纳单元collection接口定义了相关的逻辑
        // 2.成对的数据体系，就是2个数据有关系，可以根据第一个数据关联到第二个数据
        // 也可以称之为键值对数据(key:value)
    }
}
